/*

 */

class Solution {
public:
    int climbStairs(int n) {
        int sumOne = 1;
        int sumTwo = 1;
        while(n != 1){
            sumTwo += sumOne;
            sumOne = sumTwo - sumOne;
            n--;
        }
        return sumTwo;
    }
};
/*
 Main idea:

 У кожен крок ти можеш потрапити з n-1 позиції таn n-2 позиції
 за рахунок наявності двох різних кроків довжиною 1 та 2
 Таким чином кількість можливих кроків в цю позицію буде сумою
 кількості кроків в n-1 позицію та n-2 позицію

 До прикладу
 В другу позицію можна потрапити з 1 та 0. 1 спосіб потрапити в
 1 і допоміжне значення для 0 теж 1. Таким чином два способи
 потрапити в 2.

 В трійку можна потрапити з 2 і 1. В 1 можна потрапити 1 способом,
 в 2 двома, тому для трійки результатом буде 3(1, 1, 1, 1, 2, 2, 1)
 */