/*
https://leetcode.com/problems/k-inverse-pairs-array/description/?envType=daily-question&envId=2024-01-27
 */
class Solution {
public:
    int dp[1001][1001] = {};
    int kInversePairs(int n, int k) {
        if (k <= 0)
            return k == 0;
        if (dp[n][k] == 0) {
            dp[n][k] = 1;
            for (auto i = 0; i < n; ++i) {
                dp[n][k] = (dp[n][k] + kInversePairs(n - 1, k - i)) % 1000000007;
            }
        }
        return dp[n][k] - 1;
    }
};

/*
 Main idea:

 Нехай у нас є n = 4, k = 2
 [1, 2, 3, 4]
 Помістимо по черзі кожне число на першу позицію
 Утвориться різна кількість інверсій для кожного,
 ми рахуємо скільки інверсій залишилось знайти
 після переміщення числа на першу позицію
 Кількість інверсій дорівнює idx свапнутого числа
 Наприклад, оберемо 3 як число, що перемістим
 idx = 2
 [3, 1, 2, 4]
 Інверсії(2):
 3, 1
 3, 2
 Цією зміною ми знайшли початок послідовності, що
 забезпечить нам дві інверсії. Далі потрібно знайти
 такі послідовності після цього числа, що не будуть
 створювати жодних інверсій(Потрібно було знайти 2
 інверсії, ми знайшли таке число, що на першій
 позиції дає ці дві інверсії, залишилось знайти таку
 позицію чисел після цього числа, що додасть 0 інверсій)
 Тому ми продовжуєм рекурсію з n-1 числами(одне число
 перемістили на початок), тобто 3, і 0 інверсіями(адже вже
 знайшли необхідну кількість інверсій для цієї ситуації)
 Отримуєм:
 [1, 2, 4] == [1, 2, 3]
 Перший ліст - приклад зі зберіганням контексту 1-ї
 ітерації, другий без, проте зі зберіганням суті завдання.
 Можна пояснювати на обох.
 [1, 2, 4], n = 3, k = 0
 Отже, число з індексом 0 ставим на першу позицію й отримуєм
 0 додаткових інверсій - [1, 2, 4]
 Отримуєм
 [2, 4], n = 2, k = 0
 Знову потрібно знайти 0 інверсій, тому варто залишити послідовність
 у такому вигляді.
 [4], n = 1, k = 0
 [], n = 0, k = 0
 Отримати k = 0 інверсій завжди є лише один спосіб, тому в такому випадку
 додаємо до результату 1(+1 варіант отримати таку кількість інверсій)

 Для числа 3 на першій позиції є лише одна послідовність, в якій к-сть
 інверсій дорівнює 2 - [3, 1, 2, 4]
 */